codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128e.h
extern volatile __IOCPDAbits_t IOCPDAbits __asm__ ("IOCPDA") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDACLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDASET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDAINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCCONAbits_t;
extern volatile __IOCCONAbits_t IOCCONAbits __asm__ ("IOCCONA") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONACLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONASET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONAINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCIEA0:1;
    unsigned IOCIEA1:1;
    unsigned IOCIEA2:1;
    unsigned IOCIEA3:1;
    unsigned IOCIEA4:1;
    unsigned :2;
    unsigned IOCIEA7:1;
    unsigned IOCIEA8:1;
    unsigned IOCIEA9:1;
    unsigned IOCIEA10:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCIEAbits_t;
extern volatile __IOCIEAbits_t IOCIEAbits __asm__ ("IOCIEA") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEACLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEASET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEAINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFA __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCIFA0:1;
    unsigned IOCIFA1:1;
    unsigned IOCIFA2:1;
    unsigned IOCIFA3:1;
    unsigned IOCIFA4:1;
    unsigned :2;
    unsigned IOCIFA7:1;
    unsigned IOCIFA8:1;
    unsigned IOCIFA9:1;
    unsigned IOCIFA10:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCIFAbits_t;
extern volatile __IOCIFAbits_t IOCIFAbits __asm__ ("IOCIFA") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFACLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFASET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFAINV __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ANSB0:1;
    unsigned ANSB1:1;
    unsigned ANSB2:1;
    unsigned ANSB3:1;
    unsigned :9;
    unsigned ANSB13:1;
    unsigned ANSB14:1;
    unsigned ANSB15:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELBbits_t;
extern volatile __ANSELBbits_t ANSELBbits __asm__ ("ANSELB") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELBSET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELBINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISB0:1;
    unsigned TRISB1:1;
    unsigned TRISB2:1;
    unsigned TRISB3:1;
    unsigned TRISB4:1;
    unsigned TRISB5:1;
    unsigned :1;
    unsigned TRISB7:1;
    unsigned TRISB8:1;
    unsigned TRISB9:1;
    unsigned TRISB10:1;
    unsigned TRISB11:1;
    unsigned :1;
    unsigned TRISB13:1;
    unsigned TRISB14:1;
    unsigned TRISB15:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISBbits_t;
extern volatile __TRISBbits_t TRISBbits __asm__ ("TRISB") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISBSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISBINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RB2:1;
    unsigned RB3:1;
    unsigned RB4:1;
    unsigned RB5:1;
    unsigned :1;
    unsigned RB7:1;
    unsigned RB8:1;
    unsigned RB9:1;
    unsigned RB10:1;
    unsigned RB11:1;
    unsigned :1;
    unsigned RB13:1;
    unsigned RB14:1;
    unsigned RB15:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTBbits_t;
extern volatile __PORTBbits_t PORTBbits __asm__ ("PORTB") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTBSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTBINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATB0:1;
    unsigned LATB1:1;
    unsigned LATB2:1;
    unsigned LATB3:1;
    unsigned LATB4:1;
    unsigned LATB5:1;
    unsigned :1;
    unsigned LATB7:1;
    unsigned LATB8:1;
    unsigned LATB9:1;
    unsigned LATB10:1;
    unsigned LATB11:1;
    unsigned :1;
    unsigned LATB13:1;
    unsigned LATB14:1;
    unsigned LATB15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATBbits_t;
extern volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs")));
extern volatile unsigned int        LATBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATBSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATBINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :4;
    unsigned ODCB4:1;
    unsigned ODCB5:1;
    unsigned :1;
    unsigned ODCB7:1;
    unsigned ODCB8:1;
    unsigned ODCB9:1;
    unsigned ODCB10:1;
    unsigned ODCB11:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCBbits_t;
extern volatile __ODCBbits_t ODCBbits __asm__ ("ODCB") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCBSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCBINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPUB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCPUB0:1;
    unsigned IOCPUB1:1;
    unsigned IOCPUB2:1;
    unsigned IOCPUB3:1;
    unsigned IOCPUB4:1;
    unsigned IOCPUB5:1;
    unsigned :1;
    unsigned IOCPUB7:1;
    unsigned IOCPUB8:1;
    unsigned IOCPUB9:1;
    unsigned IOCPUB10:1;
    unsigned IOCPUB11:1;
    unsigned :1;
    unsigned IOCPUB13:1;
    unsigned IOCPUB14:1;
    unsigned IOCPUB15:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCPUBbits_t;
extern volatile __IOCPUBbits_t IOCPUBbits __asm__ ("IOCPUB") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPUBCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPUBSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPUBINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDB __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCPDB0:1;
    unsigned IOCPDB1:1;
    unsigned IOCPDB2:1;
    unsigned IOCPDB3:1;
    unsigned IOCPDB4:1;
    unsigned IOCPDB5:1;
    unsigned :1;
    unsigned IOCPDB7:1;
    unsigned IOCPDB8:1;
    unsigned IOCPDB9:1;
    unsigned IOCPDB10:1;
    unsigned IOCPDB11:1;
    unsigned :1;
    unsigned IOCPDB13:1;
    unsigned IOCPDB14:1;
    unsigned IOCPDB15:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCPDBbits_t;
