codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128e.h
extern volatile __IOCPDCbits_t IOCPDCbits __asm__ ("IOCPDC") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDCSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCPDCINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :13;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCCONCbits_t;
extern volatile __IOCCONCbits_t IOCCONCbits __asm__ ("IOCCONC") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONCSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCCONCINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIEC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCIEC0:1;
    unsigned IOCIEC1:1;
    unsigned IOCIEC2:1;
    unsigned IOCIEC3:1;
    unsigned IOCIEC4:1;
    unsigned IOCIEC5:1;
    unsigned IOCIEC6:1;
    unsigned IOCIEC7:1;
    unsigned IOCIEC8:1;
    unsigned IOCIEC9:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCIECbits_t;
extern volatile __IOCIECbits_t IOCIECbits __asm__ ("IOCIEC") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIECCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIECSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIECINV __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFC __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned IOCIFC0:1;
    unsigned IOCIFC1:1;
    unsigned IOCIFC2:1;
    unsigned IOCIFC3:1;
    unsigned IOCIFC4:1;
    unsigned IOCIFC5:1;
    unsigned IOCIFC6:1;
    unsigned IOCIFC7:1;
    unsigned IOCIFC8:1;
    unsigned IOCIFC9:1;
  };
  struct {
    unsigned w:32;
  };
} __IOCIFCbits_t;
extern volatile __IOCIFCbits_t IOCIFCbits __asm__ ("IOCIFC") __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFCCLR __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFCSET __attribute__((section("sfrs")));
extern volatile unsigned int        IOCIFCINV __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned USERID:16;
    unsigned :12;
    unsigned PMDL1WAY:1;
    unsigned IOL1WAY:1;
    unsigned FUSBIDIO:1;
    unsigned FVBUSONIO:1;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG3bits_t;
extern volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FPLLIDIV:3;
    unsigned :1;
    unsigned FPLLMUL:3;
    unsigned :1;
    unsigned UPLLIDIV:3;
    unsigned :4;
    unsigned UPLLEN:1;
    unsigned FPLLODIV:3;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG2bits_t;
extern volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned FNOSC:3;
    unsigned :2;
    unsigned FSOSCEN:1;
    unsigned :1;
    unsigned IESO:1;
    unsigned POSCMOD:2;
    unsigned OSCIOFNC:1;
    unsigned :1;
    unsigned FPBDIV:2;
    unsigned FCKSM:2;
    unsigned WDTPS:5;
    unsigned :1;
    unsigned WINDIS:1;
    unsigned FWDTEN:1;
    unsigned FWDTWINSZ:2;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG1bits_t;
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs")));
extern volatile unsigned int        DEVCFG0 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned DEBUG:2;
    unsigned JTAGEN:1;
    unsigned ICESEL:2;
    unsigned :5;
    unsigned PWP:6;
    unsigned :8;
    unsigned BWP:1;
    unsigned :3;
    unsigned CP:1;
  };
  struct {
    unsigned FDEBUG:2;
  };
  struct {
    unsigned w:32;
  };
} __DEVCFG0bits_t;
extern volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs")));
#ifdef __cplusplus
}
#endif

#elif defined (__LANGUAGE_ASSEMBLY__)
  .extern WDTCON           /* 0xBF800000 */
  .extern WDTCONCLR        /* 0xBF800004 */
  .extern WDTCONSET        /* 0xBF800008 */
  .extern WDTCONINV        /* 0xBF80000C */
  .extern T1CON            /* 0xBF800600 */
  .extern T1CONCLR         /* 0xBF800604 */
  .extern T1CONSET         /* 0xBF800608 */
  .extern T1CONINV         /* 0xBF80060C */
  .extern TMR1             /* 0xBF800610 */
  .extern TMR1CLR          /* 0xBF800614 */
  .extern TMR1SET          /* 0xBF800618 */
  .extern TMR1INV          /* 0xBF80061C */
  .extern PR1              /* 0xBF800620 */
  .extern PR1CLR           /* 0xBF800624 */
  .extern PR1SET           /* 0xBF800628 */
  .extern PR1INV           /* 0xBF80062C */
  .extern T2CON            /* 0xBF800800 */
  .extern T2CONCLR         /* 0xBF800804 */
  .extern T2CONSET         /* 0xBF800808 */
  .extern T2CONINV         /* 0xBF80080C */
  .extern TMR2             /* 0xBF800810 */
  .extern TMR2CLR          /* 0xBF800814 */
  .extern TMR2SET          /* 0xBF800818 */
  .extern TMR2INV          /* 0xBF80081C */
  .extern PR2              /* 0xBF800820 */
  .extern PR2CLR           /* 0xBF800824 */
  .extern PR2SET           /* 0xBF800828 */
  .extern PR2INV           /* 0xBF80082C */
  .extern T3CON            /* 0xBF800A00 */
  .extern T3CONCLR         /* 0xBF800A04 */
  .extern T3CONSET         /* 0xBF800A08 */
  .extern T3CONINV         /* 0xBF800A0C */
  .extern TMR3             /* 0xBF800A10 */
  .extern TMR3CLR          /* 0xBF800A14 */
  .extern TMR3SET          /* 0xBF800A18 */
  .extern TMR3INV          /* 0xBF800A1C */
  .extern PR3              /* 0xBF800A20 */
  .extern PR3CLR           /* 0xBF800A24 */
  .extern PR3SET           /* 0xBF800A28 */
  .extern PR3INV           /* 0xBF800A2C */
  .extern T4CON            /* 0xBF800C00 */
  .extern T4CONCLR         /* 0xBF800C04 */
  .extern T4CONSET         /* 0xBF800C08 */
  .extern T4CONINV         /* 0xBF800C0C */
  .extern TMR4             /* 0xBF800C10 */
  .extern TMR4CLR          /* 0xBF800C14 */
  .extern TMR4SET          /* 0xBF800C18 */
  .extern TMR4INV          /* 0xBF800C1C */
  .extern PR4              /* 0xBF800C20 */
  .extern PR4CLR           /* 0xBF800C24 */
  .extern PR4SET           /* 0xBF800C28 */
  .extern PR4INV           /* 0xBF800C2C */
  .extern T5CON            /* 0xBF800E00 */
  .extern T5CONCLR         /* 0xBF800E04 */
  .extern T5CONSET         /* 0xBF800E08 */
  .extern T5CONINV         /* 0xBF800E0C */
  .extern TMR5             /* 0xBF800E10 */
  .extern TMR5CLR          /* 0xBF800E14 */
  .extern TMR5SET          /* 0xBF800E18 */
  .extern TMR5INV          /* 0xBF800E1C */
  .extern PR5              /* 0xBF800E20 */
  .extern PR5CLR           /* 0xBF800E24 */
  .extern PR5SET           /* 0xBF800E28 */
  .extern PR5INV           /* 0xBF800E2C */
  .extern IC1CON           /* 0xBF802000 */
  .extern IC1CONCLR        /* 0xBF802004 */
  .extern IC1CONSET        /* 0xBF802008 */
  .extern IC1CONINV        /* 0xBF80200C */
  .extern IC1BUF           /* 0xBF802010 */
  .extern IC2CON           /* 0xBF802200 */
  .extern IC2CONCLR        /* 0xBF802204 */
  .extern IC2CONSET        /* 0xBF802208 */
  .extern IC2CONINV        /* 0xBF80220C */
  .extern IC2BUF           /* 0xBF802210 */
  .extern OC1CON           /* 0xBF803000 */
  .extern OC1CONCLR        /* 0xBF803004 */
  .extern OC1CONSET        /* 0xBF803008 */
  .extern OC1CONINV        /* 0xBF80300C */
  .extern OC1R             /* 0xBF803010 */
  .extern OC1RCLR          /* 0xBF803014 */
  .extern OC1RSET          /* 0xBF803018 */
  .extern OC1RINV          /* 0xBF80301C */
  .extern OC1RS            /* 0xBF803020 */
  .extern OC1RSCLR         /* 0xBF803024 */
  .extern OC1RSSET         /* 0xBF803028 */
  .extern OC1RSINV         /* 0xBF80302C */
  .extern OC2CON           /* 0xBF803200 */
  .extern OC2CONCLR        /* 0xBF803204 */
  .extern OC2CONSET        /* 0xBF803208 */
  .extern OC2CONINV        /* 0xBF80320C */
  .extern OC2R             /* 0xBF803210 */
  .extern OC2RCLR          /* 0xBF803214 */
  .extern OC2RSET          /* 0xBF803218 */
  .extern OC2RINV          /* 0xBF80321C */
  .extern OC2RS            /* 0xBF803220 */
  .extern OC2RSCLR         /* 0xBF803224 */
  .extern OC2RSSET         /* 0xBF803228 */
  .extern OC2RSINV         /* 0xBF80322C */
  .extern OC3CON           /* 0xBF803400 */
  .extern OC3CONCLR        /* 0xBF803404 */
  .extern OC3CONSET        /* 0xBF803408 */
  .extern OC3CONINV        /* 0xBF80340C */
  .extern OC3R             /* 0xBF803410 */
  .extern OC3RCLR          /* 0xBF803414 */
  .extern OC3RSET          /* 0xBF803418 */
  .extern OC3RINV          /* 0xBF80341C */
  .extern OC3RS            /* 0xBF803420 */
  .extern OC3RSCLR         /* 0xBF803424 */
  .extern OC3RSSET         /* 0xBF803428 */
  .extern OC3RSINV         /* 0xBF80342C */
  .extern OC4CON           /* 0xBF803600 */
  .extern OC4CONCLR        /* 0xBF803604 */
  .extern OC4CONSET        /* 0xBF803608 */
  .extern OC4CONINV        /* 0xBF80360C */
  .extern OC4R             /* 0xBF803610 */
  .extern OC4RCLR          /* 0xBF803614 */
  .extern OC4RSET          /* 0xBF803618 */
  .extern OC4RINV          /* 0xBF80361C */
  .extern OC4RS            /* 0xBF803620 */
  .extern OC4RSCLR         /* 0xBF803624 */
  .extern OC4RSSET         /* 0xBF803628 */
  .extern OC4RSINV         /* 0xBF80362C */
  .extern OC5CON           /* 0xBF803800 */
  .extern OC5CONCLR        /* 0xBF803804 */
  .extern OC5CONSET        /* 0xBF803808 */
  .extern OC5CONINV        /* 0xBF80380C */
  .extern OC5R             /* 0xBF803810 */
  .extern OC5RCLR          /* 0xBF803814 */
  .extern OC5RSET          /* 0xBF803818 */
  .extern OC5RINV          /* 0xBF80381C */
  .extern OC5RS            /* 0xBF803820 */
  .extern OC5RSCLR         /* 0xBF803824 */
  .extern OC5RSSET         /* 0xBF803828 */
  .extern OC5RSINV         /* 0xBF80382C */
  .extern OC6CON           /* 0xBF803A00 */
  .extern OC6CONCLR        /* 0xBF803A04 */
  .extern OC6CONSET        /* 0xBF803A08 */
  .extern OC6CONINV        /* 0xBF803A0C */
  .extern OC6R             /* 0xBF803A10 */
  .extern OC6RCLR          /* 0xBF803A14 */
  .extern OC6RSET          /* 0xBF803A18 */
  .extern OC6RINV          /* 0xBF803A1C */
  .extern OC6RS            /* 0xBF803A20 */
  .extern OC6RSCLR         /* 0xBF803A24 */
  .extern OC6RSSET         /* 0xBF803A28 */
  .extern OC6RSINV         /* 0xBF803A2C */
  .extern I2C1CON          /* 0xBF805000 */
  .extern I2C1ACON         /* 0xBF805000 */
  .extern I2C1CONCLR       /* 0xBF805004 */
  .extern I2C1ACONCLR      /* 0xBF805004 */
  .extern I2C1CONSET       /* 0xBF805008 */
  .extern I2C1ACONSET      /* 0xBF805008 */
  .extern I2C1CONINV       /* 0xBF80500C */
  .extern I2C1ACONINV      /* 0xBF80500C */
  .extern I2C1STAT         /* 0xBF805010 */
  .extern I2C1ASTAT        /* 0xBF805010 */
  .extern I2C1STATCLR      /* 0xBF805014 */
  .extern I2C1ASTATCLR     /* 0xBF805014 */
  .extern I2C1STATSET      /* 0xBF805018 */
  .extern I2C1ASTATSET     /* 0xBF805018 */
  .extern I2C1STATINV      /* 0xBF80501C */
  .extern I2C1ASTATINV     /* 0xBF80501C */
  .extern I2C1ADD          /* 0xBF805020 */
  .extern I2C1AADD         /* 0xBF805020 */
  .extern I2C1ADDCLR       /* 0xBF805024 */
  .extern I2C1AADDCLR      /* 0xBF805024 */
  .extern I2C1ADDSET       /* 0xBF805028 */
  .extern I2C1AADDSET      /* 0xBF805028 */
  .extern I2C1ADDINV       /* 0xBF80502C */
  .extern I2C1AADDINV      /* 0xBF80502C */
  .extern I2C1MSK          /* 0xBF805030 */
  .extern I2C1AMSK         /* 0xBF805030 */
  .extern I2C1MSKCLR       /* 0xBF805034 */
  .extern I2C1AMSKCLR      /* 0xBF805034 */
  .extern I2C1MSKSET       /* 0xBF805038 */
  .extern I2C1AMSKSET      /* 0xBF805038 */
  .extern I2C1MSKINV       /* 0xBF80503C */
  .extern I2C1AMSKINV      /* 0xBF80503C */
  .extern I2C1BRG          /* 0xBF805040 */
  .extern I2C1ABRG         /* 0xBF805040 */
  .extern I2C1BRGCLR       /* 0xBF805044 */
  .extern I2C1ABRGCLR      /* 0xBF805044 */
  .extern I2C1BRGSET       /* 0xBF805048 */
  .extern I2C1ABRGSET      /* 0xBF805048 */
  .extern I2C1BRGINV       /* 0xBF80504C */
  .extern I2C1ABRGINV      /* 0xBF80504C */
  .extern I2C1TRN          /* 0xBF805050 */
  .extern I2C1ATRN         /* 0xBF805050 */
  .extern I2C1TRNCLR       /* 0xBF805054 */
  .extern I2C1ATRNCLR      /* 0xBF805054 */
  .extern I2C1TRNSET       /* 0xBF805058 */
  .extern I2C1ATRNSET      /* 0xBF805058 */
  .extern I2C1TRNINV       /* 0xBF80505C */
  .extern I2C1ATRNINV      /* 0xBF80505C */
  .extern I2C1RCV          /* 0xBF805060 */
  .extern I2C1ARCV         /* 0xBF805060 */
  .extern I2C2CON          /* 0xBF805100 */
  .extern I2C2ACON         /* 0xBF805100 */
  .extern I2C2CONCLR       /* 0xBF805104 */
  .extern I2C2ACONCLR      /* 0xBF805104 */
  .extern I2C2CONSET       /* 0xBF805108 */
  .extern I2C2ACONSET      /* 0xBF805108 */
  .extern I2C2CONINV       /* 0xBF80510C */
  .extern I2C2ACONINV      /* 0xBF80510C */
  .extern I2C2STAT         /* 0xBF805110 */
  .extern I2C2ASTAT        /* 0xBF805110 */
  .extern I2C2STATCLR      /* 0xBF805114 */
  .extern I2C2ASTATCLR     /* 0xBF805114 */
  .extern I2C2STATSET      /* 0xBF805118 */
  .extern I2C2ASTATSET     /* 0xBF805118 */
  .extern I2C2STATINV      /* 0xBF80511C */
  .extern I2C2ASTATINV     /* 0xBF80511C */
  .extern I2C2ADD          /* 0xBF805120 */
  .extern I2C2AADD         /* 0xBF805120 */
  .extern I2C2ADDCLR       /* 0xBF805124 */
  .extern I2C2AADDCLR      /* 0xBF805124 */
  .extern I2C2ADDSET       /* 0xBF805128 */
  .extern I2C2AADDSET      /* 0xBF805128 */
  .extern I2C2ADDINV       /* 0xBF80512C */
  .extern I2C2AADDINV      /* 0xBF80512C */
  .extern I2C2MSK          /* 0xBF805130 */
  .extern I2C2AMSK         /* 0xBF805130 */
  .extern I2C2MSKCLR       /* 0xBF805134 */
  .extern I2C2AMSKCLR      /* 0xBF805134 */
  .extern I2C2MSKSET       /* 0xBF805138 */
  .extern I2C2AMSKSET      /* 0xBF805138 */
  .extern I2C2MSKINV       /* 0xBF80513C */
  .extern I2C2AMSKINV      /* 0xBF80513C */
  .extern I2C2BRG          /* 0xBF805140 */
  .extern I2C2ABRG         /* 0xBF805140 */
  .extern I2C2BRGCLR       /* 0xBF805144 */
  .extern I2C2ABRGCLR      /* 0xBF805144 */
  .extern I2C2BRGSET       /* 0xBF805148 */
  .extern I2C2ABRGSET      /* 0xBF805148 */
  .extern I2C2BRGINV       /* 0xBF80514C */
  .extern I2C2ABRGINV      /* 0xBF80514C */
  .extern I2C2TRN          /* 0xBF805150 */
  .extern I2C2ATRN         /* 0xBF805150 */
  .extern I2C2TRNCLR       /* 0xBF805154 */
  .extern I2C2ATRNCLR      /* 0xBF805154 */
  .extern I2C2TRNSET       /* 0xBF805158 */
  .extern I2C2ATRNSET      /* 0xBF805158 */
  .extern I2C2TRNINV       /* 0xBF80515C */
  .extern I2C2ATRNINV      /* 0xBF80515C */
  .extern I2C2RCV          /* 0xBF805160 */
  .extern I2C2ARCV         /* 0xBF805160 */
  .extern SPI1CON          /* 0xBF805800 */
  .extern SPI1CONCLR       /* 0xBF805804 */
  .extern SPI1CONSET       /* 0xBF805808 */
  .extern SPI1CONINV       /* 0xBF80580C */
  .extern SPI1STAT         /* 0xBF805810 */
  .extern SPI1STATCLR      /* 0xBF805814 */
  .extern SPI1STATSET      /* 0xBF805818 */
  .extern SPI1STATINV      /* 0xBF80581C */
  .extern SPI1BUF          /* 0xBF805820 */
  .extern SPI1BRG          /* 0xBF805830 */
  .extern SPI1BRGCLR       /* 0xBF805834 */
  .extern SPI1BRGSET       /* 0xBF805838 */
  .extern SPI1BRGINV       /* 0xBF80583C */
  .extern SPI1CON2         /* 0xBF805840 */
  .extern SPI1CON2CLR      /* 0xBF805844 */
  .extern SPI1CON2SET      /* 0xBF805848 */
  .extern SPI1CON2INV      /* 0xBF80584C */
  .extern SPI2CON          /* 0xBF805A00 */
  .extern SPI2CONCLR       /* 0xBF805A04 */
  .extern SPI2CONSET       /* 0xBF805A08 */
  .extern SPI2CONINV       /* 0xBF805A0C */
  .extern SPI2STAT         /* 0xBF805A10 */
  .extern SPI2STATCLR      /* 0xBF805A14 */
  .extern SPI2STATSET      /* 0xBF805A18 */
  .extern SPI2STATINV      /* 0xBF805A1C */
  .extern SPI2BUF          /* 0xBF805A20 */
  .extern SPI2BRG          /* 0xBF805A30 */
  .extern SPI2BRGCLR       /* 0xBF805A34 */
  .extern SPI2BRGSET       /* 0xBF805A38 */
  .extern SPI2BRGINV       /* 0xBF805A3C */
  .extern SPI2CON2         /* 0xBF805A40 */
  .extern SPI2CON2CLR      /* 0xBF805A44 */
  .extern SPI2CON2SET      /* 0xBF805A48 */
  .extern SPI2CON2INV      /* 0xBF805A4C */
  .extern U1MODE           /* 0xBF806000 */
  .extern U1AMODE          /* 0xBF806000 */
  .extern U1MODECLR        /* 0xBF806004 */
  .extern U1AMODECLR       /* 0xBF806004 */
  .extern U1MODESET        /* 0xBF806008 */
  .extern U1AMODESET       /* 0xBF806008 */
  .extern U1MODEINV        /* 0xBF80600C */
  .extern U1AMODEINV       /* 0xBF80600C */
  .extern U1STA            /* 0xBF806010 */
  .extern U1ASTA           /* 0xBF806010 */
  .extern U1STACLR         /* 0xBF806014 */
  .extern U1ASTACLR        /* 0xBF806014 */
  .extern U1STASET         /* 0xBF806018 */
  .extern U1ASTASET        /* 0xBF806018 */
  .extern U1STAINV         /* 0xBF80601C */
  .extern U1ASTAINV        /* 0xBF80601C */
  .extern U1TXREG          /* 0xBF806020 */
  .extern U1ATXREG         /* 0xBF806020 */
  .extern U1RXREG          /* 0xBF806030 */
  .extern U1ARXREG         /* 0xBF806030 */
  .extern U1BRG            /* 0xBF806040 */
  .extern U1ABRG           /* 0xBF806040 */
  .extern U1BRGCLR         /* 0xBF806044 */
  .extern U1ABRGCLR        /* 0xBF806044 */
  .extern U1BRGSET         /* 0xBF806048 */
  .extern U1ABRGSET        /* 0xBF806048 */
  .extern U1BRGINV         /* 0xBF80604C */
  .extern U1ABRGINV        /* 0xBF80604C */
  .extern AFECON           /* 0xBF807000 */
  .extern AFECONCLR        /* 0xBF807004 */
  .extern AFECONSET        /* 0xBF807008 */
  .extern AFECONINV        /* 0xBF80700C */
  .extern CVDTXEN0B        /* 0xBF807010 */
  .extern CVDTXEN0BCLR     /* 0xBF807014 */
  .extern CVDTXEN0BSET     /* 0xBF807018 */
  .extern CVDTXEN0BINV     /* 0xBF80701C */
  .extern CVDTXEN1B        /* 0xBF807020 */
  .extern CVDTXEN1BCLR     /* 0xBF807024 */
  .extern CVDTXEN1BSET     /* 0xBF807028 */
  .extern CVDTXEN1BINV     /* 0xBF80702C */
  .extern CVDRXEN0B        /* 0xBF807030 */
  .extern CVDRXEN0BCLR     /* 0xBF807034 */
  .extern CVDRXEN0BSET     /* 0xBF807038 */
  .extern CVDRXEN0BINV     /* 0xBF80703C */
  .extern CVDRXEN1B        /* 0xBF807040 */
  .extern CVDRXEN1BCLR     /* 0xBF807044 */
  .extern CVDRXEN1BSET     /* 0xBF807048 */
  .extern CVDRXEN1BINV     /* 0xBF80704C */
  .extern REFCON0B         /* 0xBF807050 */
  .extern REFCON0BCLR      /* 0xBF807054 */
  .extern REFCON0BSET      /* 0xBF807058 */
  .extern REFCON0BINV      /* 0xBF80705C */
  .extern REFCON1B         /* 0xBF807060 */
  .extern REFCON1BCLR      /* 0xBF807064 */
  .extern REFCON1BSET      /* 0xBF807068 */
  .extern REFCON1BINV      /* 0xBF80706C */
  .extern CVDTXEN0S        /* 0xBF807070 */
  .extern CVDTXEN0SCLR     /* 0xBF807074 */
  .extern CVDTXEN0SSET     /* 0xBF807078 */
  .extern CVDTXEN0SINV     /* 0xBF80707C */
  .extern CVDTXEN1S        /* 0xBF807080 */
  .extern CVDTXEN1SCLR     /* 0xBF807084 */
  .extern CVDTXEN1SSET     /* 0xBF807088 */
  .extern CVDTXEN1SINV     /* 0xBF80708C */
  .extern CVDRXEN0S        /* 0xBF807090 */
  .extern CVDRXEN0SCLR     /* 0xBF807094 */
  .extern CVDRXEN0SSET     /* 0xBF807098 */
  .extern CVDRXEN0SINV     /* 0xBF80709C */
  .extern CVDRXEN1S        /* 0xBF8070A0 */
  .extern CVDRXEN1SCLR     /* 0xBF8070A4 */
  .extern CVDRXEN1SSET     /* 0xBF8070A8 */
  .extern CVDRXEN1SINV     /* 0xBF8070AC */
  .extern REFCON0S         /* 0xBF8070B0 */
  .extern REFCON0SCLR      /* 0xBF8070B4 */
  .extern REFCON0SSET      /* 0xBF8070B8 */
  .extern REFCON0SINV      /* 0xBF8070BC */
  .extern REFCON1S         /* 0xBF8070C0 */
  .extern REFCON1SCLR      /* 0xBF8070C4 */
  .extern REFCON1SSET      /* 0xBF8070C8 */
  .extern REFCON1SINV      /* 0xBF8070CC */
  .extern AFEDATA          /* 0xBF8070D0 */
  .extern AFEDATACLR       /* 0xBF8070D4 */
  .extern AFEDATASET       /* 0xBF8070D8 */
  .extern AFEDATAINV       /* 0xBF8070DC */
  .extern UDCON            /* 0xBF8070E0 */
  .extern UDCONCLR         /* 0xBF8070E4 */
  .extern UDCONSET         /* 0xBF8070E8 */
  .extern UDCONINV         /* 0xBF8070EC */
  .extern CH0CON           /* 0xBF8070F0 */
  .extern CH0CONCLR        /* 0xBF8070F4 */
  .extern CH0CONSET        /* 0xBF8070F8 */
  .extern CH0CONINV        /* 0xBF8070FC */
  .extern CH1CON           /* 0xBF807100 */
  .extern CH1CONCLR        /* 0xBF807104 */
  .extern CH1CONSET        /* 0xBF807108 */
  .extern CH1CONINV        /* 0xBF80710C */
  .extern CH2CON           /* 0xBF807110 */
  .extern CH2CONCLR        /* 0xBF807114 */
  .extern CH2CONSET        /* 0xBF807118 */
  .extern CH2CONINV        /* 0xBF80711C */
  .extern CH3CON           /* 0xBF807120 */
  .extern CH3CONCLR        /* 0xBF807124 */
  .extern CH3CONSET        /* 0xBF807128 */
  .extern CH3CONINV        /* 0xBF80712C */
  .extern ADCOMCON1        /* 0xBF809000 */
  .extern ADCOMCON1CLR     /* 0xBF809004 */
  .extern ADCOMCON1SET     /* 0xBF809008 */
  .extern ADCOMCON1INV     /* 0xBF80900C */
  .extern ADCOMCON2        /* 0xBF809010 */
  .extern ADCOMCON2CLR     /* 0xBF809014 */
  .extern ADCOMCON2SET     /* 0xBF809018 */
  .extern ADCOMCON2INV     /* 0xBF80901C */
  .extern ADCOMCON3        /* 0xBF809020 */
  .extern ADCOMCON3CLR     /* 0xBF809024 */
  .extern ADCOMCON3SET     /* 0xBF809028 */
  .extern ADCOMCON3INV     /* 0xBF80902C */
  .extern AD0CON1          /* 0xBF809030 */
  .extern AD0CON1CLR       /* 0xBF809034 */
  .extern AD0CON1SET       /* 0xBF809038 */
  .extern AD0CON1INV       /* 0xBF80903C */
  .extern AD1CON1          /* 0xBF809040 */
  .extern AD1CON1CLR       /* 0xBF809044 */
  .extern AD1CON1SET       /* 0xBF809048 */
  .extern AD1CON1INV       /* 0xBF80904C */
  .extern AD2CON1          /* 0xBF809050 */
  .extern AD2CON1CLR       /* 0xBF809054 */
  .extern AD2CON1SET       /* 0xBF809058 */
  .extern AD2CON1INV       /* 0xBF80905C */
  .extern AD3CON1          /* 0xBF809060 */
  .extern AD3CON1CLR       /* 0xBF809064 */
  .extern AD3CON1SET       /* 0xBF809068 */
  .extern AD3CON1INV       /* 0xBF80906C */
  .extern AD4CON1          /* 0xBF809070 */
  .extern AD4CON1CLR       /* 0xBF809074 */
  .extern AD4CON1SET       /* 0xBF809078 */
  .extern AD4CON1INV       /* 0xBF80907C */
  .extern ADC0RESR         /* 0xBF809080 */
  .extern ADC0RESRCLR      /* 0xBF809084 */
  .extern ADC0RESRSET      /* 0xBF809088 */
  .extern ADC0RESRINV      /* 0xBF80908C */
  .extern ADC1RESR         /* 0xBF809090 */
  .extern ADC1RESRCLR      /* 0xBF809094 */
  .extern ADC1RESRSET      /* 0xBF809098 */
  .extern ADC1RESRINV      /* 0xBF80909C */
  .extern ADC2RESR         /* 0xBF8090A0 */
  .extern ADC2RESRCLR      /* 0xBF8090A4 */
  .extern ADC2RESRSET      /* 0xBF8090A8 */
  .extern ADC2RESRINV      /* 0xBF8090AC */
  .extern ADC3RESR         /* 0xBF8090B0 */
  .extern ADC3RESRCLR      /* 0xBF8090B4 */
  .extern ADC3RESRSET      /* 0xBF8090B8 */
  .extern ADC3RESRINV      /* 0xBF8090BC */
  .extern ADC4RESR         /* 0xBF8090C0 */
  .extern ADC4RESRCLR      /* 0xBF8090C4 */
  .extern ADC4RESRSET      /* 0xBF8090C8 */
  .extern ADC4RESRINV      /* 0xBF8090CC */
  .extern ADCOMCHS         /* 0xBF8090D0 */
  .extern ADCOMCHSCLR      /* 0xBF8090D4 */
  .extern ADCOMCHSSET      /* 0xBF8090D8 */
  .extern ADCOMCHSINV      /* 0xBF8090DC */
  .extern CICCON           /* 0xBF80A400 */
  .extern CICCONCLR        /* 0xBF80A404 */
  .extern CICCONSET        /* 0xBF80A408 */
  .extern CICCONINV        /* 0xBF80A40C */
  .extern CICLEN           /* 0xBF80A410 */
  .extern CICLENCLR        /* 0xBF80A414 */
