codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128e.h
#define _CVDRXEN0S_RX1_1_POSITION                0x00000006
#define _CVDRXEN0S_RX1_1_MASK                    0x00000040
#define _CVDRXEN0S_RX1_1_LENGTH                  0x00000001

#define _CVDRXEN0S_RX2_1_POSITION                0x00000007
#define _CVDRXEN0S_RX2_1_MASK                    0x00000080
#define _CVDRXEN0S_RX2_1_LENGTH                  0x00000001

#define _CVDRXEN0S_RX3_1_POSITION                0x00000008
#define _CVDRXEN0S_RX3_1_MASK                    0x00000100
#define _CVDRXEN0S_RX3_1_LENGTH                  0x00000001

#define _CVDRXEN0S_RX4_1_POSITION                0x00000009
#define _CVDRXEN0S_RX4_1_MASK                    0x00000200
#define _CVDRXEN0S_RX4_1_LENGTH                  0x00000001

#define _CVDRXEN0S_RX0_2_POSITION                0x0000000A
#define _CVDRXEN0S_RX0_2_MASK                    0x00000400
#define _CVDRXEN0S_RX0_2_LENGTH                  0x00000001

#define _CVDRXEN0S_RX1_2_POSITION                0x0000000B
#define _CVDRXEN0S_RX1_2_MASK                    0x00000800
#define _CVDRXEN0S_RX1_2_LENGTH                  0x00000001

#define _CVDRXEN0S_RX2_2_POSITION                0x0000000C
#define _CVDRXEN0S_RX2_2_MASK                    0x00001000
#define _CVDRXEN0S_RX2_2_LENGTH                  0x00000001

#define _CVDRXEN0S_RX3_2_POSITION                0x0000000D
#define _CVDRXEN0S_RX3_2_MASK                    0x00002000
#define _CVDRXEN0S_RX3_2_LENGTH                  0x00000001

#define _CVDRXEN0S_RX4_2_POSITION                0x0000000E
#define _CVDRXEN0S_RX4_2_MASK                    0x00004000
#define _CVDRXEN0S_RX4_2_LENGTH                  0x00000001

#define _CVDRXEN0S_RX0_3_POSITION                0x0000000F
#define _CVDRXEN0S_RX0_3_MASK                    0x00008000
#define _CVDRXEN0S_RX0_3_LENGTH                  0x00000001

#define _CVDRXEN0S_RX1_3_POSITION                0x00000010
#define _CVDRXEN0S_RX1_3_MASK                    0x00010000
#define _CVDRXEN0S_RX1_3_LENGTH                  0x00000001

#define _CVDRXEN0S_RX2_3_POSITION                0x00000011
#define _CVDRXEN0S_RX2_3_MASK                    0x00020000
#define _CVDRXEN0S_RX2_3_LENGTH                  0x00000001

#define _CVDRXEN0S_RX3_3_POSITION                0x00000012
#define _CVDRXEN0S_RX3_3_MASK                    0x00040000
#define _CVDRXEN0S_RX3_3_LENGTH                  0x00000001

#define _CVDRXEN0S_RX4_3_POSITION                0x00000013
#define _CVDRXEN0S_RX4_3_MASK                    0x00080000
#define _CVDRXEN0S_RX4_3_LENGTH                  0x00000001

#define _CVDRXEN0S_RX0_4_POSITION                0x00000014
#define _CVDRXEN0S_RX0_4_MASK                    0x00100000
#define _CVDRXEN0S_RX0_4_LENGTH                  0x00000001

#define _CVDRXEN0S_RX1_4_POSITION                0x00000015
#define _CVDRXEN0S_RX1_4_MASK                    0x00200000
#define _CVDRXEN0S_RX1_4_LENGTH                  0x00000001

#define _CVDRXEN0S_RX2_4_POSITION                0x00000016
#define _CVDRXEN0S_RX2_4_MASK                    0x00400000
#define _CVDRXEN0S_RX2_4_LENGTH                  0x00000001

#define _CVDRXEN0S_RX3_4_POSITION                0x00000017
#define _CVDRXEN0S_RX3_4_MASK                    0x00800000
#define _CVDRXEN0S_RX3_4_LENGTH                  0x00000001

#define _CVDRXEN0S_RX4_4_POSITION                0x00000018
#define _CVDRXEN0S_RX4_4_MASK                    0x01000000
#define _CVDRXEN0S_RX4_4_LENGTH                  0x00000001

#define _CVDRXEN0S_RX0_5_POSITION                0x00000019
#define _CVDRXEN0S_RX0_5_MASK                    0x02000000
#define _CVDRXEN0S_RX0_5_LENGTH                  0x00000001

#define _CVDRXEN0S_RX1_5_POSITION                0x0000001A
#define _CVDRXEN0S_RX1_5_MASK                    0x04000000
#define _CVDRXEN0S_RX1_5_LENGTH                  0x00000001

#define _CVDRXEN0S_RX2_5_POSITION                0x0000001B
#define _CVDRXEN0S_RX2_5_MASK                    0x08000000
#define _CVDRXEN0S_RX2_5_LENGTH                  0x00000001

#define _CVDRXEN0S_RX3_5_POSITION                0x0000001C
#define _CVDRXEN0S_RX3_5_MASK                    0x10000000
#define _CVDRXEN0S_RX3_5_LENGTH                  0x00000001

#define _CVDRXEN0S_RX4_5_POSITION                0x0000001D
#define _CVDRXEN0S_RX4_5_MASK                    0x20000000
#define _CVDRXEN0S_RX4_5_LENGTH                  0x00000001

#define _CVDRXEN0S_RX0_6_POSITION                0x0000001E
#define _CVDRXEN0S_RX0_6_MASK                    0x40000000
#define _CVDRXEN0S_RX0_6_LENGTH                  0x00000001

#define _CVDRXEN0S_RX1_6_POSITION                0x0000001F
#define _CVDRXEN0S_RX1_6_MASK                    0x80000000
#define _CVDRXEN0S_RX1_6_LENGTH                  0x00000001

#define _CVDRXEN1S_RX2_6_POSITION                0x00000000
#define _CVDRXEN1S_RX2_6_MASK                    0x00000001
#define _CVDRXEN1S_RX2_6_LENGTH                  0x00000001

#define _CVDRXEN1S_RX3_6_POSITION                0x00000001
#define _CVDRXEN1S_RX3_6_MASK                    0x00000002
#define _CVDRXEN1S_RX3_6_LENGTH                  0x00000001

#define _CVDRXEN1S_RX4_6_POSITION                0x00000002
#define _CVDRXEN1S_RX4_6_MASK                    0x00000004
#define _CVDRXEN1S_RX4_6_LENGTH                  0x00000001

#define _CVDRXEN1S_RX0_7_POSITION                0x00000003
#define _CVDRXEN1S_RX0_7_MASK                    0x00000008
#define _CVDRXEN1S_RX0_7_LENGTH                  0x00000001

#define _CVDRXEN1S_RX1_7_POSITION                0x00000004
#define _CVDRXEN1S_RX1_7_MASK                    0x00000010
#define _CVDRXEN1S_RX1_7_LENGTH                  0x00000001

#define _CVDRXEN1S_RX2_7_POSITION                0x00000005
#define _CVDRXEN1S_RX2_7_MASK                    0x00000020
#define _CVDRXEN1S_RX2_7_LENGTH                  0x00000001

#define _CVDRXEN1S_RX3_7_POSITION                0x00000006
#define _CVDRXEN1S_RX3_7_MASK                    0x00000040
#define _CVDRXEN1S_RX3_7_LENGTH                  0x00000001

#define _CVDRXEN1S_RX4_7_POSITION                0x00000007
#define _CVDRXEN1S_RX4_7_MASK                    0x00000080
#define _CVDRXEN1S_RX4_7_LENGTH                  0x00000001

#define _CVDRXEN1S_RX0_8_POSITION                0x00000008
#define _CVDRXEN1S_RX0_8_MASK                    0x00000100
#define _CVDRXEN1S_RX0_8_LENGTH                  0x00000001

#define _CVDRXEN1S_RX1_8_POSITION                0x00000009
#define _CVDRXEN1S_RX1_8_MASK                    0x00000200
#define _CVDRXEN1S_RX1_8_LENGTH                  0x00000001

