codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128e.h
#define _CVDRXEN1S_RX2_8_POSITION                0x0000000A
#define _CVDRXEN1S_RX2_8_MASK                    0x00000400
#define _CVDRXEN1S_RX2_8_LENGTH                  0x00000001

#define _CVDRXEN1S_RX3_8_POSITION                0x0000000B
#define _CVDRXEN1S_RX3_8_MASK                    0x00000800
#define _CVDRXEN1S_RX3_8_LENGTH                  0x00000001

#define _CVDRXEN1S_RX4_8_POSITION                0x0000000C
#define _CVDRXEN1S_RX4_8_MASK                    0x00001000
#define _CVDRXEN1S_RX4_8_LENGTH                  0x00000001

#define _CVDRXEN1S_RX0_9_POSITION                0x0000000D
#define _CVDRXEN1S_RX0_9_MASK                    0x00002000
#define _CVDRXEN1S_RX0_9_LENGTH                  0x00000001

#define _CVDRXEN1S_RX1_9_POSITION                0x0000000E
#define _CVDRXEN1S_RX1_9_MASK                    0x00004000
#define _CVDRXEN1S_RX1_9_LENGTH                  0x00000001

#define _CVDRXEN1S_RX2_9_POSITION                0x0000000F
#define _CVDRXEN1S_RX2_9_MASK                    0x00008000
#define _CVDRXEN1S_RX2_9_LENGTH                  0x00000001

#define _CVDRXEN1S_RX3_9_POSITION                0x00000010
#define _CVDRXEN1S_RX3_9_MASK                    0x00010000
#define _CVDRXEN1S_RX3_9_LENGTH                  0x00000001

#define _CVDRXEN1S_RX4_9_POSITION                0x00000011
#define _CVDRXEN1S_RX4_9_MASK                    0x00020000
#define _CVDRXEN1S_RX4_9_LENGTH                  0x00000001

#define _CVDRXEN1S_RX0_10_POSITION               0x00000012
#define _CVDRXEN1S_RX0_10_MASK                   0x00040000
#define _CVDRXEN1S_RX0_10_LENGTH                 0x00000001

#define _CVDRXEN1S_RX1_10_POSITION               0x00000013
#define _CVDRXEN1S_RX1_10_MASK                   0x00080000
#define _CVDRXEN1S_RX1_10_LENGTH                 0x00000001

#define _CVDRXEN1S_RX2_10_POSITION               0x00000014
#define _CVDRXEN1S_RX2_10_MASK                   0x00100000
#define _CVDRXEN1S_RX2_10_LENGTH                 0x00000001

#define _CVDRXEN1S_RX3_10_POSITION               0x00000015
#define _CVDRXEN1S_RX3_10_MASK                   0x00200000
#define _CVDRXEN1S_RX3_10_LENGTH                 0x00000001

#define _CVDRXEN1S_RX4_10_POSITION               0x00000016
#define _CVDRXEN1S_RX4_10_MASK                   0x00400000
#define _CVDRXEN1S_RX4_10_LENGTH                 0x00000001

#define _REFCON0S_REFCON0_POSITION               0x00000000
#define _REFCON0S_REFCON0_MASK                   0x000000FF
#define _REFCON0S_REFCON0_LENGTH                 0x00000008

#define _REFCON0S_REFCON1_POSITION               0x00000008
#define _REFCON0S_REFCON1_MASK                   0x0000FF00
#define _REFCON0S_REFCON1_LENGTH                 0x00000008

#define _REFCON0S_REFCON2_POSITION               0x00000010
#define _REFCON0S_REFCON2_MASK                   0x00FF0000
#define _REFCON0S_REFCON2_LENGTH                 0x00000008

#define _REFCON0S_REFGAIN3_POSITION              0x00000018
#define _REFCON0S_REFGAIN3_MASK                  0xFF000000
#define _REFCON0S_REFGAIN3_LENGTH                0x00000008

#define _REFCON1S_REFGAIN4_POSITION              0x00000000
#define _REFCON1S_REFGAIN4_MASK                  0x000000FF
#define _REFCON1S_REFGAIN4_LENGTH                0x00000008

#define _AFEDATA_DATA_POSITION                   0x00000000
#define _AFEDATA_DATA_MASK                       0xFFFFFFFF
#define _AFEDATA_DATA_LENGTH                     0x00000020

#define _UDCON_TX0EN_POSITION                    0x00000000
#define _UDCON_TX0EN_MASK                        0x00000001
#define _UDCON_TX0EN_LENGTH                      0x00000001

#define _UDCON_TX1EN_POSITION                    0x00000001
#define _UDCON_TX1EN_MASK                        0x00000002
#define _UDCON_TX1EN_LENGTH                      0x00000001

#define _UDCON_RX0EN_POSITION                    0x00000003
#define _UDCON_RX0EN_MASK                        0x00000008
#define _UDCON_RX0EN_LENGTH                      0x00000001

#define _UDCON_RX1EN_POSITION                    0x00000004
#define _UDCON_RX1EN_MASK                        0x00000010
#define _UDCON_RX1EN_LENGTH                      0x00000001

#define _UDCON_REF0EN_POSITION                   0x00000006
#define _UDCON_REF0EN_MASK                       0x00000040
#define _UDCON_REF0EN_LENGTH                     0x00000001

#define _UDCON_REF1EN_POSITION                   0x00000007
#define _UDCON_REF1EN_MASK                       0x00000080
#define _UDCON_REF1EN_LENGTH                     0x00000001

#define _UDCON_TARGIDX_POSITION                  0x00000008
#define _UDCON_TARGIDX_MASK                      0x00000700
#define _UDCON_TARGIDX_LENGTH                    0x00000003

#define _UDCON_CLRCNT_POSITION                   0x0000000B
#define _UDCON_CLRCNT_MASK                       0x00000800
#define _UDCON_CLRCNT_LENGTH                     0x00000001

#define _UDCON_CHCONIDX_POSITION                 0x0000000C
#define _UDCON_CHCONIDX_MASK                     0x00007000
#define _UDCON_CHCONIDX_LENGTH                   0x00000003

#define _UDCON_CHDMA_POSITION                    0x0000000F
#define _UDCON_CHDMA_MASK                        0x00008000
#define _UDCON_CHDMA_LENGTH                      0x00000001

#define _UDCON_LEN_POSITION                      0x00000010
#define _UDCON_LEN_MASK                          0x00FF0000
#define _UDCON_LEN_LENGTH                        0x00000008

#define _UDCON_COUNT_POSITION                    0x00000018
#define _UDCON_COUNT_MASK                        0xFF000000
#define _UDCON_COUNT_LENGTH                      0x00000008

#define _CH0CON_DIFFGAIN_POSITION                0x00000000
#define _CH0CON_DIFFGAIN_MASK                    0x00000003
#define _CH0CON_DIFFGAIN_LENGTH                  0x00000002

#define _CH0CON_LPFILTSEL_POSITION               0x00000004
#define _CH0CON_LPFILTSEL_MASK                   0x000000F0
#define _CH0CON_LPFILTSEL_LENGTH                 0x00000004

#define _CH0CON_CVDEN_POSITION                   0x00000008
#define _CH0CON_CVDEN_MASK                       0x00000100
#define _CH0CON_CVDEN_LENGTH                     0x00000001

#define _CH0CON_CHPRE_POSITION                   0x00000009
#define _CH0CON_CHPRE_MASK                       0x00000200
#define _CH0CON_CHPRE_LENGTH                     0x00000001

#define _CH0CON_BIASEN_POSITION                  0x0000000A
#define _CH0CON_BIASEN_MASK                      0x00000400
#define _CH0CON_BIASEN_LENGTH                    0x00000001

#define _CH0CON_POLINV_POSITION                  0x0000000B
#define _CH0CON_POLINV_MASK                      0x00000800
#define _CH0CON_POLINV_LENGTH                    0x00000001

#define _CH0CON_DCAPSEL_POSITION                 0x0000000C
#define _CH0CON_DCAPSEL_MASK                     0x00003000
#define _CH0CON_DCAPSEL_LENGTH                   0x00000002

#define _CH0CON_DCAPPWR_POSITION                 0x0000000F
#define _CH0CON_DCAPPWR_MASK                     0x00008000
#define _CH0CON_DCAPPWR_LENGTH                   0x00000001

#define _CH0CON_GRXPRE_POSITION                  0x00000010
#define _CH0CON_GRXPRE_MASK                      0x00010000
#define _CH0CON_GRXPRE_LENGTH                    0x00000001

