codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128e.h
#define _IOCCONA_ON_POSITION                     0x0000000F
#define _IOCCONA_ON_MASK                         0x00008000
#define _IOCCONA_ON_LENGTH                       0x00000001

#define _IOCCONA_w_POSITION                      0x00000000
#define _IOCCONA_w_MASK                          0xFFFFFFFF
#define _IOCCONA_w_LENGTH                        0x00000020

#define _IOCIEA_IOCIEA0_POSITION                 0x00000000
#define _IOCIEA_IOCIEA0_MASK                     0x00000001
#define _IOCIEA_IOCIEA0_LENGTH                   0x00000001

#define _IOCIEA_IOCIEA1_POSITION                 0x00000001
#define _IOCIEA_IOCIEA1_MASK                     0x00000002
#define _IOCIEA_IOCIEA1_LENGTH                   0x00000001

#define _IOCIEA_IOCIEA2_POSITION                 0x00000002
#define _IOCIEA_IOCIEA2_MASK                     0x00000004
#define _IOCIEA_IOCIEA2_LENGTH                   0x00000001

#define _IOCIEA_IOCIEA3_POSITION                 0x00000003
#define _IOCIEA_IOCIEA3_MASK                     0x00000008
#define _IOCIEA_IOCIEA3_LENGTH                   0x00000001

#define _IOCIEA_IOCIEA4_POSITION                 0x00000004
#define _IOCIEA_IOCIEA4_MASK                     0x00000010
#define _IOCIEA_IOCIEA4_LENGTH                   0x00000001

#define _IOCIEA_IOCIEA7_POSITION                 0x00000007
#define _IOCIEA_IOCIEA7_MASK                     0x00000080
#define _IOCIEA_IOCIEA7_LENGTH                   0x00000001

#define _IOCIEA_IOCIEA8_POSITION                 0x00000008
#define _IOCIEA_IOCIEA8_MASK                     0x00000100
#define _IOCIEA_IOCIEA8_LENGTH                   0x00000001

#define _IOCIEA_IOCIEA9_POSITION                 0x00000009
#define _IOCIEA_IOCIEA9_MASK                     0x00000200
#define _IOCIEA_IOCIEA9_LENGTH                   0x00000001

#define _IOCIEA_IOCIEA10_POSITION                0x0000000A
#define _IOCIEA_IOCIEA10_MASK                    0x00000400
#define _IOCIEA_IOCIEA10_LENGTH                  0x00000001

#define _IOCIEA_w_POSITION                       0x00000000
#define _IOCIEA_w_MASK                           0xFFFFFFFF
#define _IOCIEA_w_LENGTH                         0x00000020

#define _IOCIFA_IOCIFA0_POSITION                 0x00000000
#define _IOCIFA_IOCIFA0_MASK                     0x00000001
#define _IOCIFA_IOCIFA0_LENGTH                   0x00000001

#define _IOCIFA_IOCIFA1_POSITION                 0x00000001
#define _IOCIFA_IOCIFA1_MASK                     0x00000002
#define _IOCIFA_IOCIFA1_LENGTH                   0x00000001

#define _IOCIFA_IOCIFA2_POSITION                 0x00000002
#define _IOCIFA_IOCIFA2_MASK                     0x00000004
#define _IOCIFA_IOCIFA2_LENGTH                   0x00000001

#define _IOCIFA_IOCIFA3_POSITION                 0x00000003
#define _IOCIFA_IOCIFA3_MASK                     0x00000008
#define _IOCIFA_IOCIFA3_LENGTH                   0x00000001

#define _IOCIFA_IOCIFA4_POSITION                 0x00000004
#define _IOCIFA_IOCIFA4_MASK                     0x00000010
#define _IOCIFA_IOCIFA4_LENGTH                   0x00000001

#define _IOCIFA_IOCIFA7_POSITION                 0x00000007
#define _IOCIFA_IOCIFA7_MASK                     0x00000080
#define _IOCIFA_IOCIFA7_LENGTH                   0x00000001

#define _IOCIFA_IOCIFA8_POSITION                 0x00000008
#define _IOCIFA_IOCIFA8_MASK                     0x00000100
#define _IOCIFA_IOCIFA8_LENGTH                   0x00000001

#define _IOCIFA_IOCIFA9_POSITION                 0x00000009
#define _IOCIFA_IOCIFA9_MASK                     0x00000200
#define _IOCIFA_IOCIFA9_LENGTH                   0x00000001

#define _IOCIFA_IOCIFA10_POSITION                0x0000000A
#define _IOCIFA_IOCIFA10_MASK                    0x00000400
#define _IOCIFA_IOCIFA10_LENGTH                  0x00000001

#define _IOCIFA_w_POSITION                       0x00000000
#define _IOCIFA_w_MASK                           0xFFFFFFFF
#define _IOCIFA_w_LENGTH                         0x00000020

#define _ANSELB_ANSB0_POSITION                   0x00000000
#define _ANSELB_ANSB0_MASK                       0x00000001
#define _ANSELB_ANSB0_LENGTH                     0x00000001

#define _ANSELB_ANSB1_POSITION                   0x00000001
#define _ANSELB_ANSB1_MASK                       0x00000002
#define _ANSELB_ANSB1_LENGTH                     0x00000001

#define _ANSELB_ANSB2_POSITION                   0x00000002
#define _ANSELB_ANSB2_MASK                       0x00000004
#define _ANSELB_ANSB2_LENGTH                     0x00000001

#define _ANSELB_ANSB3_POSITION                   0x00000003
#define _ANSELB_ANSB3_MASK                       0x00000008
#define _ANSELB_ANSB3_LENGTH                     0x00000001

#define _ANSELB_ANSB13_POSITION                  0x0000000D
#define _ANSELB_ANSB13_MASK                      0x00002000
#define _ANSELB_ANSB13_LENGTH                    0x00000001

#define _ANSELB_ANSB14_POSITION                  0x0000000E
#define _ANSELB_ANSB14_MASK                      0x00004000
#define _ANSELB_ANSB14_LENGTH                    0x00000001

#define _ANSELB_ANSB15_POSITION                  0x0000000F
#define _ANSELB_ANSB15_MASK                      0x00008000
#define _ANSELB_ANSB15_LENGTH                    0x00000001

#define _ANSELB_w_POSITION                       0x00000000
#define _ANSELB_w_MASK                           0xFFFFFFFF
#define _ANSELB_w_LENGTH                         0x00000020

#define _TRISB_TRISB0_POSITION                   0x00000000
#define _TRISB_TRISB0_MASK                       0x00000001
#define _TRISB_TRISB0_LENGTH                     0x00000001

#define _TRISB_TRISB1_POSITION                   0x00000001
#define _TRISB_TRISB1_MASK                       0x00000002
#define _TRISB_TRISB1_LENGTH                     0x00000001

#define _TRISB_TRISB2_POSITION                   0x00000002
#define _TRISB_TRISB2_MASK                       0x00000004
#define _TRISB_TRISB2_LENGTH                     0x00000001

#define _TRISB_TRISB3_POSITION                   0x00000003
#define _TRISB_TRISB3_MASK                       0x00000008
#define _TRISB_TRISB3_LENGTH                     0x00000001

