codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mx251f128e.h
#define _IOCPDC_w_POSITION                       0x00000000
#define _IOCPDC_w_MASK                           0xFFFFFFFF
#define _IOCPDC_w_LENGTH                         0x00000020

#define _IOCCONC_SIDL_POSITION                   0x0000000D
#define _IOCCONC_SIDL_MASK                       0x00002000
#define _IOCCONC_SIDL_LENGTH                     0x00000001

#define _IOCCONC_ON_POSITION                     0x0000000F
#define _IOCCONC_ON_MASK                         0x00008000
#define _IOCCONC_ON_LENGTH                       0x00000001

#define _IOCCONC_w_POSITION                      0x00000000
#define _IOCCONC_w_MASK                          0xFFFFFFFF
#define _IOCCONC_w_LENGTH                        0x00000020

#define _IOCIEC_IOCIEC0_POSITION                 0x00000000
#define _IOCIEC_IOCIEC0_MASK                     0x00000001
#define _IOCIEC_IOCIEC0_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC1_POSITION                 0x00000001
#define _IOCIEC_IOCIEC1_MASK                     0x00000002
#define _IOCIEC_IOCIEC1_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC2_POSITION                 0x00000002
#define _IOCIEC_IOCIEC2_MASK                     0x00000004
#define _IOCIEC_IOCIEC2_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC3_POSITION                 0x00000003
#define _IOCIEC_IOCIEC3_MASK                     0x00000008
#define _IOCIEC_IOCIEC3_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC4_POSITION                 0x00000004
#define _IOCIEC_IOCIEC4_MASK                     0x00000010
#define _IOCIEC_IOCIEC4_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC5_POSITION                 0x00000005
#define _IOCIEC_IOCIEC5_MASK                     0x00000020
#define _IOCIEC_IOCIEC5_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC6_POSITION                 0x00000006
#define _IOCIEC_IOCIEC6_MASK                     0x00000040
#define _IOCIEC_IOCIEC6_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC7_POSITION                 0x00000007
#define _IOCIEC_IOCIEC7_MASK                     0x00000080
#define _IOCIEC_IOCIEC7_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC8_POSITION                 0x00000008
#define _IOCIEC_IOCIEC8_MASK                     0x00000100
#define _IOCIEC_IOCIEC8_LENGTH                   0x00000001

#define _IOCIEC_IOCIEC9_POSITION                 0x00000009
#define _IOCIEC_IOCIEC9_MASK                     0x00000200
#define _IOCIEC_IOCIEC9_LENGTH                   0x00000001

#define _IOCIEC_w_POSITION                       0x00000000
#define _IOCIEC_w_MASK                           0xFFFFFFFF
#define _IOCIEC_w_LENGTH                         0x00000020

#define _IOCIFC_IOCIFC0_POSITION                 0x00000000
#define _IOCIFC_IOCIFC0_MASK                     0x00000001
#define _IOCIFC_IOCIFC0_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC1_POSITION                 0x00000001
#define _IOCIFC_IOCIFC1_MASK                     0x00000002
#define _IOCIFC_IOCIFC1_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC2_POSITION                 0x00000002
#define _IOCIFC_IOCIFC2_MASK                     0x00000004
#define _IOCIFC_IOCIFC2_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC3_POSITION                 0x00000003
#define _IOCIFC_IOCIFC3_MASK                     0x00000008
#define _IOCIFC_IOCIFC3_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC4_POSITION                 0x00000004
#define _IOCIFC_IOCIFC4_MASK                     0x00000010
#define _IOCIFC_IOCIFC4_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC5_POSITION                 0x00000005
#define _IOCIFC_IOCIFC5_MASK                     0x00000020
#define _IOCIFC_IOCIFC5_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC6_POSITION                 0x00000006
#define _IOCIFC_IOCIFC6_MASK                     0x00000040
#define _IOCIFC_IOCIFC6_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC7_POSITION                 0x00000007
#define _IOCIFC_IOCIFC7_MASK                     0x00000080
#define _IOCIFC_IOCIFC7_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC8_POSITION                 0x00000008
#define _IOCIFC_IOCIFC8_MASK                     0x00000100
#define _IOCIFC_IOCIFC8_LENGTH                   0x00000001

#define _IOCIFC_IOCIFC9_POSITION                 0x00000009
#define _IOCIFC_IOCIFC9_MASK                     0x00000200
#define _IOCIFC_IOCIFC9_LENGTH                   0x00000001

#define _IOCIFC_w_POSITION                       0x00000000
#define _IOCIFC_w_MASK                           0xFFFFFFFF
#define _IOCIFC_w_LENGTH                         0x00000020

#define _DEVCFG3_USERID_POSITION                 0x00000000
#define _DEVCFG3_USERID_MASK                     0x0000FFFF
#define _DEVCFG3_USERID_LENGTH                   0x00000010

#define _DEVCFG3_PMDL1WAY_POSITION               0x0000001C
#define _DEVCFG3_PMDL1WAY_MASK                   0x10000000
#define _DEVCFG3_PMDL1WAY_LENGTH                 0x00000001

#define _DEVCFG3_IOL1WAY_POSITION                0x0000001D
#define _DEVCFG3_IOL1WAY_MASK                    0x20000000
#define _DEVCFG3_IOL1WAY_LENGTH                  0x00000001

#define _DEVCFG3_FUSBIDIO_POSITION               0x0000001E
#define _DEVCFG3_FUSBIDIO_MASK                   0x40000000
#define _DEVCFG3_FUSBIDIO_LENGTH                 0x00000001

#define _DEVCFG3_FVBUSONIO_POSITION              0x0000001F
#define _DEVCFG3_FVBUSONIO_MASK                  0x80000000
#define _DEVCFG3_FVBUSONIO_LENGTH                0x00000001

#define _DEVCFG3_w_POSITION                      0x00000000
#define _DEVCFG3_w_MASK                          0xFFFFFFFF
#define _DEVCFG3_w_LENGTH                        0x00000020

#define _DEVCFG2_FPLLIDIV_POSITION               0x00000000
#define _DEVCFG2_FPLLIDIV_MASK                   0x00000007
#define _DEVCFG2_FPLLIDIV_LENGTH                 0x00000003

#define _DEVCFG2_FPLLMUL_POSITION                0x00000004
#define _DEVCFG2_FPLLMUL_MASK                    0x00000070
#define _DEVCFG2_FPLLMUL_LENGTH                  0x00000003

#define _DEVCFG2_UPLLIDIV_POSITION               0x00000008
#define _DEVCFG2_UPLLIDIV_MASK                   0x00000700
#define _DEVCFG2_UPLLIDIV_LENGTH                 0x00000003

